Revit 2027 API
LinearArray.GetOriginalMemberIds Method
Retrieves the ids for the original elements from which the array was created. These elements form the first item in the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override ICollection<ElementId> GetOriginalMemberIds()
Public Overrides Function GetOriginalMemberIds As ICollection(Of ElementId)
public:
virtual ICollection<ElementId^>^ GetOriginalMemberIds() override
abstract GetOriginalMemberIds : unit -> ICollection<ElementId>
override GetOriginalMemberIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
The original member ids of the Array
Remarks
In the family environment, arrays with count 0 use the original elements as a placeholder item for the first array item. The ids of the original elements from which the array was created are returned even for arrays of count 0.
See Also
Reference
LinearArray Class
Autodesk.Revit.DB Namespace